import { Link } from "react-router-dom";
import BigLogoImage from "../components/BigLogoImage";

const Cabinet = () => {
  return (
    <main className="layout_main flex row mobile--column content--space-between mobile-content--start items--start">
      <div className="main_section left desktop-only">
        <div className="section_logo">
          <Link to="/">
            <BigLogoImage />
          </Link>
        </div>

        <div className="anchor_wrapper flex column content--space-between items--center">
          <div className="anchor_chain"></div>
          <div className="anchor_container">
            <svg version="1.1" id="Слой_1" xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" viewBox="0 0 726.9 965.6">
              <path
                d="M350.8,936.5c0-213.7,0-426.5,0-640.3c-37.2,0-75,0-112.9,0c0-10.3,0-19.6,0-29.3c37.7,0,75.2,0,113.3,0
                    c0-28.3,0-56.7,0-85.1c-6.5-2.1-13.5-3.7-20-6.4c-36.6-15.1-58.8-50.7-56.4-89.9c2.3-38.4,29.2-71.4,66.9-82
                    c53.2-15,108.2,22.3,114.3,77.5c5.2,46.8-25.2,89.3-71,99.3c-2.2,0.5-4.1,0.6-4.1,3.8c0.1,27.3,0,54.7,0,82c0,0.3,0.2,0.6,0.7,1.8
                    c36.9,0,74.1,0,111.6,0c0,10.3,0,19.7,0,29.3c-37.4,0-74.5,0-112.6,0c0,212.8,0,425.7,0,639.2c52.6-2.4,103.1-15.2,150.8-39.1
                    c56.2-28.1,102.7-67.8,140.5-120.2c-29.4,0-57.3,0-85.3,0c0-10.4,0-19.8,0-29.9c46.9,0.6,93.3,1.1,140.3,1.7
                    c-1.1,46.6-2.1,92.7-3.1,139c-9.7,0-19.2,0-29.3,0c0.7-31.4,1.4-62.2,2-93.7c-84,111-194.6,171.6-333.6,171.6
                    c-139.1,0-249.8-60.5-333.9-171.3c0,31.2,0,61.9,0,92.9c-9.7,0-19.1,0-29.1,0c0-46.6,0-93,0-139.4c46.1,0,92.2,0,138.6,0
                    c0,9.9,0,19.3,0,29.1c-28.1,0-56,0-85.1,0c27,37.9,59.2,69.4,97.2,95C210.8,912.3,277.3,933.6,350.8,936.5z M303.9,91
                    c-0.1,33.8,27.6,61.7,61.5,61.9c33.9,0.2,62.1-27.9,62-61.9c-0.1-33.9-27.9-61.7-61.7-61.7C331.9,29.4,304,57.2,303.9,91z"
              ></path>
            </svg>
          </div>
        </div>
      </div>
      <div className="main_section right flex column content--space-between items--start">
        <div className="section_title_container flex row content--space-between items--start">
          <h1 className="section_title">Кабинет</h1>
          <div className="anchor_container_mobile anchor mobile-only">
            <svg version="1.1" id="Слой_1" xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" viewBox="0 0 726.9 965.6">
              <path
                d="M350.8,936.5c0-213.7,0-426.5,0-640.3c-37.2,0-75,0-112.9,0c0-10.3,0-19.6,0-29.3c37.7,0,75.2,0,113.3,0
                    c0-28.3,0-56.7,0-85.1c-6.5-2.1-13.5-3.7-20-6.4c-36.6-15.1-58.8-50.7-56.4-89.9c2.3-38.4,29.2-71.4,66.9-82
                    c53.2-15,108.2,22.3,114.3,77.5c5.2,46.8-25.2,89.3-71,99.3c-2.2,0.5-4.1,0.6-4.1,3.8c0.1,27.3,0,54.7,0,82c0,0.3,0.2,0.6,0.7,1.8
                    c36.9,0,74.1,0,111.6,0c0,10.3,0,19.7,0,29.3c-37.4,0-74.5,0-112.6,0c0,212.8,0,425.7,0,639.2c52.6-2.4,103.1-15.2,150.8-39.1
                    c56.2-28.1,102.7-67.8,140.5-120.2c-29.4,0-57.3,0-85.3,0c0-10.4,0-19.8,0-29.9c46.9,0.6,93.3,1.1,140.3,1.7
                    c-1.1,46.6-2.1,92.7-3.1,139c-9.7,0-19.2,0-29.3,0c0.7-31.4,1.4-62.2,2-93.7c-84,111-194.6,171.6-333.6,171.6
                    c-139.1,0-249.8-60.5-333.9-171.3c0,31.2,0,61.9,0,92.9c-9.7,0-19.1,0-29.1,0c0-46.6,0-93,0-139.4c46.1,0,92.2,0,138.6,0
                    c0,9.9,0,19.3,0,29.1c-28.1,0-56,0-85.1,0c27,37.9,59.2,69.4,97.2,95C210.8,912.3,277.3,933.6,350.8,936.5z M303.9,91
                    c-0.1,33.8,27.6,61.7,61.5,61.9c33.9,0.2,62.1-27.9,62-61.9c-0.1-33.9-27.9-61.7-61.7-61.7C331.9,29.4,304,57.2,303.9,91z"
              ></path>
            </svg>
          </div>
        </div>
        <div className="section_content">
          Петровская эпоха многообразна и уникальна. Рассказать и показать о всем своеобразии этого временя должен петровский
          Кабинет – место погружения в петровскую эпоху через статьи, медиа и другой разнообразный контент.
        </div>
        <div className="section_submenu flex column content--end items--start">
          <ul className="flex column">
            <li className="">
              <Link to="/articles">Статьи</Link>
            </li>
          </ul>
        </div>
      </div>
    </main>
  );
};

export default Cabinet;
